Tekla Open API Reference for Tekla Structures 2025
MaterialMarketSizesItem Properties
The MaterialMarketSizesItem type exposes the following members.
Properties
Name | Description
MarketSizes
 Available MarketSizes for the particular material
MaterialName
 Material name
Top
See Also
Reference
MaterialMarketSizesItem Class
Tekla.Structures.Catalogs Namespace